Рабочая.Задачи2/src/Catalogs/ЦБР_Задача/ЦБР_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_Задача</name>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ВидЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЧасыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЧасыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратитьВнимание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредСогласованныеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительЗадачи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стартовала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзялиВРаботу</name>
    <comment>Истина = Руководитель проверил и взял задачу в работу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипЗадачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команда</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.ЦБР_РольВЗадаче</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Выбрана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.ЦБР_Конфигурации1С</types>
        <types>CatalogRef.cbr_Конфигурации1С</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Релиз</name>
      <type>
        <types>EnumRef._центрСостояниеРелизовКонфигураций</types>
      </type>
    </attributes>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеКонфигурации</name>
      <type>
        <types>EnumRef._центрСостоянияКонфигурацийКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьРасширения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проблемная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонфигурацияКлиентаОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>Приложение</name>
      <type>
        <types>CatalogRef.ЦБР_ЗадачаПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/Enums/ЦБР_ТипОценкиЗадачи/ЦБР_ТипОценкиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ТипОценкиЗадачи</name>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
  <enumValues>
    <name>Предсогласованные</name>
  </enumValues>
  <enumValues>
    <name>Стандартная</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Catalogs/ЦБР_Задача/Forms/ФормаСогласования/Module.bsl
#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаЗадание") Тогда
		СсылкаНаЗадание = Параметры.СсылкаНаЗадание;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗадание) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не заполнено задание для согласования");
		Возврат;
	КонецЕсли;	
	
	ЗначенияРеквизитов     = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЗадание, "Описание,ТрудозатратыПлан,ТрудозатратыПланСтарый,КомментарийОценки,СсылкаНаЗадачу,ВидЧаса,ОплатаПоФакту,ТипОценкиЗадачи");
	ОписаниеЗадания        = ЗначенияРеквизитов.Описание.Получить(); 
	ТрудозатратыПлан       = ЗначенияРеквизитов.ТрудозатратыПлан;
	ТрудозатратыПланСтарый = ЗначенияРеквизитов.ТрудозатратыПланСтарый;  
	КомментарийОценки      = ЗначенияРеквизитов.КомментарийОценки; 
	ВидЧаса                = ЗначенияРеквизитов.ВидЧаса; 
	ОплатаПоФакту          = ЗначенияРеквизитов.ОплатаПоФакту; 
    ТипОценкиЗадачи        = ЗначенияРеквизитов.ТипОценкиЗадачи;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудозатратыПланСтарый", "Видимость", Не ОплатаПоФакту);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудозатратыПлан", "Видимость", Не ОплатаПоФакту);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОплатаПоФакту", "Видимость", ОплатаПоФакту);
	
	Если ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные Тогда
		ТрудозатратыПланСтарый = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПредсогласованныеЧасы(ЗначенияРеквизитов.СсылкаНаЗадачу);  
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудозатратыПланСтарый", "Заголовок", "Уже согласовано часов"); 		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудозатратыПлан", "Заголовок", "Доп. часы к согласованию"); 
	ИначеЕсли ТрудозатратыПлан = ТрудозатратыПланСтарый Или ТрудозатратыПланСтарый = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудозатратыПланСтарый", "Видимость", Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура Отказать(Команда)
	
	Если СокрЛП(КомментарийОтказа) = "" Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажи причину отказа"); 
		Возврат;
	КонецЕсли;   
	
	СтруктураОтказа = Новый Структура();
	СтруктураОтказа.Вставить("Согласование", Ложь);                    
	СтруктураОтказа.Вставить("КомментарийОтказа", КомментарийОтказа);     
	СтруктураОтказа.Вставить("СсылкаНаЗадание", СсылкаНаЗадание);
	Закрыть(СтруктураОтказа);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда) 
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Согласовываем оценку?",
        РежимДиалогаВопрос.ОКОтмена,
        0, 
        КодВозвратаДиалога.ОК,
        "Согласование");   
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.ОК Тогда
		СтруктураСогласования = Новый Структура();
		СтруктураСогласования.Вставить("Согласование", Истина);                    
		СтруктураСогласования.Вставить("СсылкаНаЗадание", СсылкаНаЗадание);
		Закрыть(СтруктураСогласования)
    КонецЕсли;	
 
КонецПроцедуры

#КонецОбласти
